tests/vizualizing_simulation_data/bernard_cell_of_v2/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

# runApplication setFields

runApplication $(getApplication)

#------------------------------------------------------------------------------
